package cn.yoren.srs.demo.utils;

/**
 * @author zsq
 * @create 2019-07-09-16:51
 */
public enum ErrorEnum { E_200("200", "请求成功"),
    E_201("201", "创建请求"),
    E_202("202", "服务器已接受请求，但尚未处理"),
    E_20200("20200", "服务器已接受请求，正在处理中"),
    E_400("400", "请求失败，请求处理异常，请稍后再试"),
    E_401("401", "请求失败，请求要求身份验证"),
    E_403("403", "请求失败，服务器拒绝请求"),
    E_404("404", "请求失败，请求的资源不存在"),
    E_405("405", "请求失败，禁用请求中指定的方法"),
    E_406("406", "请求失败，无法使用请求的内容特性响应请求的网页"),
    E_407("407", "请求失败，指定请求者应当授权使用代理"),
    E_408("408", "请求失败，服务器等候请求时发生超时"),
    E_409("409", "请求失败，服务器在完成请求时发生冲突"),
    E_410("410", "请求失败，请求的资源已永久删除"),
    E_411("411", "请求失败，服务器不接受不含有效内容长度标头字段的请求"),
    E_412("412", "请求失败，服务器未满足请求者在请求中设置的其中一个前提条件"),
    E_413("413", "请求失败，服务器无法处理请求，因为请求实体过大，超出服务器的处理能力"),
    E_414("414", "请求失败，请求的 URI（通常为网址）过长，服务器无法处理"),
    E_415("415", "请求失败，请求的格式不受请求页面的支持"),
    E_500("500", "请求失败，服务器遇到错误，无法完成请求"),
    E_501("501", "请求失败，服务器不具备完成请求的功能"),
    E_502("502", "请求失败，错误网关"),
    E_503("503", "请求失败，服务器目前无法使用"),
    E_504("504", "请求失败，网关超时"),
    E_505("505", "请求失败，务器不支持请求中所用的 HTTP 协议版本"),
    E_800("800", "操作失败"),
    E_900("900", "异常错误"),
    E_10001("10001", "数据库存在了该记录"),
    E_20001("20001", "请求成功，但有错误信息返回"),
    E_40101("40101", "登陆已过期,请重新登陆"),
    E_40201("40201", "非法用户"),
    E_90003("30001", "缺少必填参数");

    private String errorCode;
    private String errorMsg;

    private ErrorEnum() {
    }

    private ErrorEnum(String errorCode, String errorMsg) {
        this.errorCode = errorCode;
        this.errorMsg = errorMsg;
    }

    public String getErrorCode() {
        return this.errorCode;
    }

    public void setErrorCode(String errorCode) {
        this.errorCode = errorCode;
    }

    public String getErrorMsg() {
        return this.errorMsg;
    }

    public void setErrorMsg(String errorMsg) {
        this.errorMsg = errorMsg;
    }
}
